Revit 2024 API
Wall.CanHaveProfileSketch Method
 Checks whether this wall has or can have a profile sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool CanHaveProfileSketch()
Visual Basic
Public Function CanHaveProfileSketch As Boolean
Visual C++
public:
bool CanHaveProfileSketch()
Return Value
 True if wall supports profile sketch, false otherwise.
Remarks
 Wall does not support profile if it is not a straight wall; or wall is tapered; or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.
See Also
Wall Class
Autodesk.Revit.DB Namespace